base/Documents/бит_СведенияОбОстаткахДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_СведенияОбОстаткахДенежныхСредств</Name>
			<Comment>(БИТ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_СведенияОДвиженииДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.бит_СведенияОбОстаткахДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного элемента справочника (документа)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНач</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКон</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СведенияОНаличных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНач</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКон</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СведенияОБанковскихСчетах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНач</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКон</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/Documents/бит_СведенияОбОстаткахДенежныхСредств/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект, Пользователи.ТекущийПользователь());
												
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 	
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияНачало(ЭтотОбъект);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Модуль 				= Документы.бит_СведенияОбОстаткахДенежныхСредств;
	ПараметрыПроведения = Модуль.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	Модуль.СформироватьДвиженияСведенияОбОстаткахДенежныхСредств(
		ПараметрыПроведения.СведенияОбОстаткахДенежныхСредств,
		ПараметрыПроведения.Реквизиты,
		Движения, Отказ);
		
	Модуль.СформироватьДвиженияСведенияОДвиженииДенежныхСредств(
		ПараметрыПроведения.СведенияОДвиженииДенежныхСредств,
		ПараметрыПроведения.Реквизиты,
		Движения, Отказ);
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаПроведенияЗавершение(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеЗначения = Новый Соответствие; 
	Для каждого СтрокаТаблицы Из СведенияОБанковскихСчетах Цикл
		
		ЗначениеДляПроверки = СтрокаТаблицы.БанковскийСчет;
		
		Результат = ПроверяемыеЗначения.Получить(ЗначениеДляПроверки);
		Если Результат = Неопределено Тогда
			ПроверяемыеЗначения.Вставить(ЗначениеДляПроверки, ЗначениеДляПроверки);
			Продолжить;
		КонецЕсли;
		
		СинонимПоля    = НСтр("ru = 'Банковский счет';en = 'Bank Account'");
		ТекстПояснения = НСтр("ru = 'Значение повторяется.'; en = 'The value is repeated.'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка" , "Корректность", 
							СинонимПоля, формат(СтрокаТаблицы.НомерСтроки, "ЧГ="), 
							НСтр("ru = 'Сведения о банковских счетах';en = 'Information about bank accounts'"), ТекстПояснения);
							
		Поле = СтрШаблон("СведенияОБанковскихСчетах[%1].%2", СтрокаТаблицы.НомерСтроки - 1, "БанковскийСчет");					
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, ,Отказ); 
	КонецЦикла; 
	
	ЕстьСправочникКассы = Метаданные.Справочники.Найти("Кассы") <> Неопределено;
	
	ПроверяемыеЗначения = Новый Соответствие; 
	Для каждого СтрокаТаблицы Из СведенияОНаличных Цикл
		
		Если ЕстьСправочникКассы Тогда
			ЗначениеДляПроверки = СтрокаТаблицы.Касса;
			СинонимПоля = НСтр("ru = 'Касса'; en = 'Cash'");
			ИмяПоля 	= "Касса";
		Иначе
			ЗначениеДляПроверки = СтрокаТаблицы.Валюта;
			СинонимПоля = НСтр("ru = 'Валюта';en = 'Currency'");
			ИмяПоля 	= "Валюта";
		КонецЕсли;
		
		Результат = ПроверяемыеЗначения.Получить(ЗначениеДляПроверки);
		Если Результат = Неопределено Тогда
			ПроверяемыеЗначения.Вставить(ЗначениеДляПроверки, ЗначениеДляПроверки);
			Продолжить;
		КонецЕсли;
		
		ТекстПояснения = НСтр("ru = 'Значение повторяется.'; en = 'The value is repeated.'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка" , "Корректность", 
							СинонимПоля, формат(СтрокаТаблицы.НомерСтроки, "ЧГ="), 
							НСтр("ru = 'Сведения о наличных';en = 'Information about cash'"), ТекстПояснения);
							
		Поле = СтрШаблон("СведенияОНаличных[%1].%2", СтрокаТаблицы.НомерСтроки - 1, ИмяПоля);					
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, ,Отказ); 
	КонецЦикла; 
	
	НепроверяемыеРеквизиты = Новый Массив();
	Если ЕстьСправочникКассы Тогда
		НепроверяемыеРеквизиты.Добавить("СведенияОНаличных.Валюта");
	Иначе
		НепроверяемыеРеквизиты.Добавить("СведенияОНаличных.Касса");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначенияПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	// СтандартныеПодсистемы.ОбновлениеВерсииИБ
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если УдалитьСведения.Количество() > 0 Тогда
		СчетаКассы = Новый Массив; 
		Для Каждого СтрокаТаблицы Из УдалитьСведения Цикл
			СчетаКассы.Добавить(СтрокаТаблицы.БанковскийСчет);
		КонецЦикла;
		
		Результат = Документы.бит_СведенияОбОстаткахДенежныхСредств.НачальныеОстатки(СчетаКассы);
		Для Каждого СтрокаТаблицы Из УдалитьСведения Цикл
			СтрокаТаблицы.СуммаНач = Результат.Получить(СтрокаТаблицы.БанковскийСчет); 
			СтрокаТаблицы.СуммаПриход = 0;
			СтрокаТаблицы.СуммаРасход = 0;
			СтрокаТаблицы.СуммаКон = СтрокаТаблицы.СуммаНач;
		КонецЦикла;
	КонецЕсли; 
	
	Ответственный = Пользователи.ТекущийПользователь();
	Комментарий	  = "";
	
КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
